#+TITLE: Emacs komande

** Org Babel
+ osnovna sintaksa za pisanje koda je =#+START_SRC= i =#+END_SRC=, a prečac =<s<TAB>=
+ =<SPC>m'= otvara novi /buffer/ za pisanje koda (=<C-c><C-c>= je za spremanje promjena i zatvaranje /buffer/-a)
+ jednom kada je kod ispisan, =<RET>= u normalnom modu, ili =<C-c><C-c>= općenito, izvršava blok koda
# TODO za sada ne uspijevam dobiti evaluaciju koda za node uopće, a za python dobivam samo kada odredim :session (?).

#+begin_src emacs-lisp

(use-package pyvenv
  :ensure t
  :config
  (pyvenv-mode t)

  ;; Set correct Python interpreter
  (setq pyvenv-post-activate-hooks
        (list (lambda ()
                (setq python-shell-interpreter (concat pyvenv-virtual-env "~/miniforge-pypy3/bin/")))))
  (setq pyvenv-post-deactivate-hooks
        (list (lambda ()
                (setq python-shell-interpreter "python3")))))

#+end_src

#+begin_src emacs-lisp
(setq python-shell-interpreter (concat pyvenv-virtual-env "$HOME/miniforge-pypy3/bin/"))
(pyvenv-mode t)
#+end_src
#+RESULTS:
: t

#+begin_src python :session testing
import random

def x(a):
    return a + random.randint(1,5)

x(2)
#+end_src

#+RESULTS:
: 4

+ a može se namjestitit i automatska konverzija datoteka u /.org/,(v. [[https://martibosch.github.io/jupyter-emacs-universe/][martibosch/jupiter-emacs-universe]]) npr.:
#+begin_src emacs-lisp
(setq code-cells-convert-ipynb-style '(
("pandoc" "--to" "ipynb" "--from" "org")
    ("pandoc" "--to" "org" "--from" "ipynb")
    org-mode))
#+end_src

